{
    "en": {
        "title": "Command list",
        "commands": [
            {"type": "intro", "command": "/intro", "short_desc": "Introduction to the Blockchain-Based Heroes of Mavia Game."},
            {"type": "gameplay", "command": "/gameplay", "short_desc": "Gameplay details"},
            {"type": "tokens", "command": "/tokens", "short_desc": "Heroes of Mavia Tokens"},
            {"type": "nfts", "command": "/nfts", "short_desc": "Three different types of NFTs, each with their own uniqie puprose and value in the game"},
            {"type": "earn", "command": "/earn", "short_desc": "How to earn. Economic model of the game"},
            {"type": "platforms", "command": "/platforms", "short_desc": "List of supported gaming platforms"},
            {"type": "team", "command": "/team", "short_desc": "Core developers team"},
            {"type": "more", "command": "/more", "short_desc": "More info about project. Site, Social networks, Game Deck"}
        ],
        "full_command_desc": {
            "intro": "Heroes of Mavia is an online multiplayer blockchain-based strategy game where players use their base and army to battle other players and compete for real cryptocurrency in a play-to-earn fashion. Player can purchase, rent, or partner with landowners to acquire and build a base in the game, earning more rewards as they battle with increasingly difficult bases built by other players around the world.\n\nMavia was inspired by two of the largest games: Axie Infinity(blockchain) & Clash of Clans(mobile) taking the best elements from each and combining the into an experience never seen before.",
            "gameplay": "The player's objective is to grow their base and army by using ressources in the game gained from attacking other players bases. The main resources in the game are Gold, Oil, and Ruby, with Ruby ($RUBY) being one of the two cryptocurrencies used in Mavia's Dual Token model.\n\n🌎🛩**Build your Ground and Air Forces**\nYour army consists of Vehicle, Infantry, and Air units, each with a clear tactical advantage.\n\n🛡**Assemble your Defensive Army**\nDefensive buildings and units attack your opponent's army and can be upgraded to increase their power and defensive abilities.\n\n🏰**Level up your HQ**\nAt the core of any base is the Headquarters, and upgrading the HQ level allows for more advanced buildings, traps, and troops to be build.\n\n🗼**Maximize your Walls and Towers**\nWalls are the primary defense protecting your base and buildings from attackers. Walls can be upgraded and strategically positioned to funnel oponents into traps.\n\n🕸**Deploy Traps and Decoys**\nTraps make it easier to defend your base against opponents and are typically hidden from attackers untill their troops come in contract with the trap.\n\n⚔️**Upgrade NFT Heroes**\nHeroes defend your base from opponents and can also be used in offensive strikes. All Heroes have Special Powers which can be used in attacks.",
            "tokens": "The Mavia ecosystem is powered by two cryptocurrencies: MAVIA & RUBY\n\n**MAVIA:**\nMAVIA is the governance token and the only currency used to exchange NFTs on the Mavia marketplace.\n\n👨‍⚖️ **Governance Token**\n🔄**Currency used for Buying and Sellinf NFTs**\n💲**Staking Rewards and Staking NFT Prizes**\n🌏**MAVIA is not an in-game ressource**\n\n**RUBY:**\nRUBY is the in-game 'play-to-earn' reward currency that allows players to upgrade their NFTs.\n\n🎁**Reward Token**\n🎮**Used primarily in-game for upgrading NFTs**\n💴**Can be deposited and withdrawn from game**\n🔥**RUBY spent in-game will be burned automatically**",
            "nfts": "🗺**Bases/Land**\nBases are at the core of the heroes of Mavia, and owning a base is required to play.\n\n🦸**Heroes**\nHeroes assis the player in both attacking opponent bases, as well as protecting the home base defensive battles.\n\n🗽**Statues**\nStatues can be placed on a base to give boost to base stats, production rates and more.\n\nDetailed information about each type of nft on [this](https://statics.mavia.com/landing/public/game_deck_en.pdf#page=8) page",
            "earn": "**Playing**\nPlayers are able to earn RUBY when successfully attacking an opponents's base, but they can also earn RUBY for successfully defending their base from an enemy's attack with little-to-no damage, making it possible to earn even while not playing the game.\n\n**Buying and Selling gaming NFTs on Mavia Marketplace**\nFor example: The owner of the base can sell the land on the Mavia marketplace for MAVIA token, passing down all of the progress made on the base to the new owner.\n\n**Renting out base**\nBase owners are able to rent out their base according to a range of dates and a price set by the owner. The tenant of the base will pay upfront MAVIA to the owner, but will in turn be able to earn and keep all of the RUBY generated from using the base. This includes RUBY won from battling opponents, successful defensive battles, completing challenges, finding rare items, and other events which earn players RUBY. The owner of the base will not benefit from this RUBY being generated by the player, but will instead be generating passive income in the form of MAVIA from the rental agreement.",
            "platforms": "🖥 **Desktop Web**\n📱**Mobile web** / **Android app** / **iOS app**",
            "team": "[**SKRICE STUDIO**](https://statics.mavia.com/landing/public/game_deck.pdf#page=22)",
            "more": "🌐**Oficial site**\n\n- https://www.mavia.com/\n\n🔵**Social networks**\n\n-Telegram: https://t.me/MaviaAnnouncements\n-Discord: https://discord.com/invite/maviaofficial\n-Twitter: https://twitter.com/MaviaGame\n-YouTube: https://www.youtube.com/channel/UCEsG9bqZilH29cW6gC5oApQ\n-Medium: https://medium.com/heroes-of-mavia\n\n📄**Game Deck**\n\n- https://statics.mavia.com/landing/public/game_deck_en.pdf"
        }
    },
    "ru": {
        "title": "Список команд",
        "commands": [
            {"type": "intro", "command": "/intro", "short_desc": "Введение в блокчейн игру Heroes of Mavia Game."},
            {"type": "gameplay", "command": "/gameplay", "short_desc": "Игровые детали"},
            {"type": "tokens", "command": "/tokens", "short_desc": "Heroes of Mavia Токены"},
            {"type": "nfts", "command": "/nfts", "short_desc": "Три ращличных вида NFTs, каждая из которых имеет собственную уникальную возможность и ценность в игре"},
            {"type": "earn", "command": "/earn", "short_desc": "Как зарабатывать. Экономическая модель игры."},
            {"type": "platforms", "command": "/platforms", "short_desc": "Список поддерживаемых игровых платформ"},
            {"type": "team", "command": "/team", "short_desc": "Команда разработчиков игры"},
            {"type": "more", "command": "/more", "short_desc": "Больше информации о проекте. Сайт, Социальные сети, Game Deck"}
        ],
        "full_command_desc": {
            "intro": "Heroes of Mavia - это стратегическая игра созданная на базе блокчейн технологии, где игроки могут иметь свои базы и армии. Вести битвы с другими игроками получая за победу или удачные оборонительные действия реальную криптовалюту. Игроки могут самостоятельно или объединяясь, приобретать, сдавать или брать в аренду земли.\n\nMavia была вдохновлена двумя крупнейшими играми: Axie Infinity(блокчейн) & Clash of Clans(мобильная) взяв лучшие элементы от каждой из них и скомбинировав новый неведомо ранее опыт.",
            "gameplay": "Цель игроков - это развивать свои базы и армии используя рессурсы полученные от нападения на базы других игроков или успешной обороны своей от нападения. Основными рессурсами внутри игры являются: Золото, Нефть и Рубины. Рубины ($RUBY) является одной из двух криптовалют, используемых в модели двойных токенов Mavia.\n\n🌎🛩**Создавайте свои наземные и воздушные силы**\nВаша армия состоит из Техники, Пехоты и Воздушных сил, каждая из которых имеет свои тактические приемущества.\n\n🛡**Соберайте свою оборонительную армию**\nОборонительные силы можно модернизировать улучшая их качество и возможности.\n\n🏰**Повышай уровень своего штаба**\nВ основе любой базы лежит штаб, а повышение уровня штаба позволяет строить более совершенные здания, ловушки и войска.\n\n🗼**Улучшайте качество своих Стен и Вышек**\nСтены - это основная защита вашей базы от нападающих. Стены можно модернизировать и улучшать стратегически, чтобы загнать противников в ловушки.\n\n🕸**Расставляйте ловушки и приманки**\nЛовушки облегчают защиту вашей базы от противников и обычно скрыты от нападающих до тех пор, пока их войска не вступят в контакт с ней.\n\n⚔️**Модернизируйте своих NFT героев**\nГерои защищают вашу базу от противников, а также могут быть использованы в наступательных ударах. Все герои обладают особыми способностями, которые можно использовать в атаках.",
            "tokens": "Экосистема Mavia базируется на двух криптовалютах: MAVIA & RUBY\n\n**MAVIA:**\nявляется управляющим токеном и используется только как валюта обмена в маркетплейсе MAVIA.\n\n👨‍⚖️ **Токен управления**\n🔄**Покупка и продажа NFTs**\n💲**Вознаграждение за стейкинг и распределение призов**\n🌏**MAVIA не является внутриигровым ресурсом**\n\n**RUBY:**\nRUBY является внутриигровой валютой которая позволяет игрокам модернизировать свои NFTs(Базы, Статуи, Герои)**\n💴**Можно пополнять счет и выводить средства из игры**\n🔥**Потраченные в игре RUBY будут сжигаться автоматически**",
            "nfts": "🗺**Базы/Земли**\nБазы лежат в основе героев Mavia, и владение базой необходимо для игры.\n\n🦸**Герои**\nпомогают игроку как в атаке на базы противников, так и при оборонительных действиях на домашней базе.\n\n🗽**Статуи**\nСтатуи могут быть установлены на базу, чтобы увеличить ее силу, производительность и многое другое.\n\nПодробнаую информацию по каждому из типов NFTs вы можете узнать на [этой](https://statics.mavia.com/landing/public/game_deck_en.pdf#page=8) странице",
            "earn": "**Играя**\nИгроки могут зарабатывать RUBY как при успешносй атаке на базу противника, так и при успешной защите своей. Что дает возможность усовершенствовать свою базу и зарабатывать даже находясь офлайн.\n\n**Покупка и продажа игровых NFTs на Mavia маркетплейсе**\nНапример: Владелец базы может продать свою землю на маркетплейсе Mavia за токен $MAVIA, передав весь прогресс, достигнутый на базе, новому владельцу.\n\n**Сдача базы в аренду**\nВладельцы базы могут сдавать свою базу в аренду в соответствии с диапазоном дат и ценой, установленной владельцем. Арендатор базы выплачивает владельцу аванс в размере MAVIA, но в свою очередь сможет заработать и сохранить все RUBY, полученные от использования базы. Сюда входят RUBY, полученные за сражения с противниками, успешные оборонительные бои, прохождение испытаний, и другие события, которые могут приносить игрокам RUBY. Владелец базы не будет получать выгоду от этих RUBY, генерируемых игроком, но вместо этого будет получать пассивный доход в виде MAVIA от договора аренды.",
            "platforms": "🖥 **Desktop Web**\n📱**Mobile web** / **Android app** / **iOS app**",
            "team": "[**SKRICE STUDIO**](https://statics.mavia.com/landing/public/game_deck.pdf#page=22)",
            "more": "🌐**Официальный сайт**\n\n- https://www.mavia.com/\n\n🔵**Социальные сети**\n\n-Telegram: https://t.me/MaviaAnnouncements\n-Discord: https://discord.com/invite/maviaofficial\n-Twitter: https://twitter.com/MaviaGame\n-YouTube: https://www.youtube.com/channel/UCEsG9bqZilH29cW6gC5oApQ\n-Medium: https://medium.com/heroes-of-mavia\n\n📄**Game Deck**\n\n- https://statics.mavia.com/landing/public/game_deck_en.pdf"
        }
    }
}